export const WorkExperience = [
  {
    company: '招商银行 · 招银网络科技',
    period: '2021.7 ~ 至今',
    project: [
      {
        name: 'CMB Design 设计管理平台',
        content: [
          '负责设计主题配置工具的开发，提供基于antd的可视化样式配置。打通D2C之间交流的障碍，实现设计师通过可视化的样式配置，实现不同组件样式风格的切换，主题包发布之后开发即可通过插件应用于项目中。目前服务于50+行内系统，100+应用，旨在降低行内前端开发与设计之间的沟通成本。',
          '负责设计平台主题市场的建设，通过主题市场的丰富来沉淀共有及私有资产，公开主题可供所有人查看并使用，私有主题可以添加团队成员共同开发和使用。',
          '负责设计资源管理平台的开发，包括设计规范、设计资源、设计公开课等模块，设计师使用平台来沉淀行内设计规范，将各条业务线总结出来的典型场景归纳在一起，逐步形成行内统一标准，构建统一设计风格，设计标准。',
          '使用nodejs开发主题配置工具配套插件，设计仅需要发布主题后开发即可通过插件更新主题样式，提升主题配置工具使用的效率；使用next.js为主题包样式在线打包开发bff中间件。',
          '根据业务调研，使用 dumi 搭建招行组件库，并使其能够被主题配置工具所覆盖，沉淀前端业务组件资产。',
        ],
      },
      {
        name: '物料中心',
        content: [
          '参与前端物料中心中心脚手架的建设，包括物料的创建、同步和使用，推动前端开发人员以及团队拥有自己的资产库。',
        ],
      },
    ],
  },
];

export const Skills = [
  '掌握HTML5、CSS3、JavaScript等前端技术，并且熟练运用React等主流前端框架。有扎实的编程基础和良好的设计模式编程思想，能够封装编程规范的组件库和代码库。',
  '具备深入理解前端架构设计的能力，能够通过架构设计调整应用程序结构、优化应用性能、提升应用使用体验。熟悉基础设施、部署架构、性能优化等方面的技术，能够制定前端技术架构方案。',
  ' 精通敏捷开发流程，能够为团队制定规范的开发流程和制定计划，有效提升开发效率和质量。熟练使用前端开发工具和技术，如 Webpack、Grunt、Gulp等。',
  '保持对前端最新技术和潮流的持续探索和学习，并通过实践应用到项目开发中。研究新技术和趋势并在应用中运用，如PWA、微前端、WebAssembly等。在前端领域保持敏感性，对项目开发整体的前景和前沿趋势做精确的预测和思考。',
];

export const Practices = [
  '使用 react + express + docker + github workflow 搭建个人网站。',
  '使用nodejs开发个人react脚手架，提供react + typescript + webpack/vite/eslint/prettier。',
];
